src/spedCadastro/newXMLDocument.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope">
    <env:Header>
        <nfeCabecMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/CadConsultaCadastro2">
            <versaoDados>2.00</versaoDados>
            <cUF>42</cUF>
        </nfeCabecMsg>
    </env:Header>
    <env:Body>
        <nfeDadosMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/CadConsultaCadastro2">
            <ConsCad xmlns="http://www.portalfiscal.inf.br/nfe" versao="2.00">
                <infCons>
                    <xServ>CONS-CAD</xServ>
                    <UF>SC</UF>
                    <CNPJ>05528196000105</CNPJ>
                </infCons>
            </ConsCad>
        </nfeDadosMsg>
    </env:Body>
</env:Envelope>